Backchannel_Application/app/controllers/posts_controller.rb

INSERT INTO "posts" ("users_id", "grade", "created_at", "updated_at", "content") VALUES(8, 0, '2010-09-30 03:41:24', '2010-09-30 03:41:24', 'here is final post to check color combination.
INSERT INTO "comments" ("created_at", "reply", "updated_at", "original_post") VALUES('2010-09-26 20:23:25', 25, '2010-09-26 20:23:25', 23)
---
  def create
    @post = Post.new(params[:post])
    @post.users_id = session[:user_id]
    @post.save
    if session[:reply] == true
      puts "this is reply"
      @comment = Comment.new
      @comment.original_post =   session[:originalid]
      @comment.reply = @post.id.to_s
      @comment.save

SELECT * FROM "comments" WHERE (reply = '27' or original_post = '27') LIMIT 1
DELETE FROM "comments" WHERE "id" = 4
SELECT * FROM "posts" WHERE ("posts"."id" = 27)
SELECT * FROM "cheers" WHERE (posts_id = '72')
DELETE FROM "cheers" WHERE "id" = 33
DELETE FROM "posts" WHERE "id" = 27
---
  def destroy
    @allcomments = Comment.find(:all,:conditions => ["reply = ?", params[:id]])
    for comment in @allcomments
        comment.destroy
    end

    @allcomments = Comment.find(:all,:conditions => ["original_post = ?",params[:id]])
    for comment in @allcomments
         @post = Post.find(comment.reply)
         @cheers = Cheer.find(:all,:conditions => ["posts_id = ?", @post.id])
         for cheer in @cheers
              cheer.destroy
         end
         @post.destroy

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "cheers" ("users_id", "created_at", "updated_at", "posts_id") VALUES(5, '2010-09-26 07:23:01', '2010-09-26 07:23:01', 1)
---
  def cheerup
    @post = Post.find(params[:id])
    @cheer = Cheer.new
    @cheer.users_id= session[:user_id]
    @cheer.posts_id= @post.id
    @cheer.save

SELECT * FROM "cheers" WHERE (users_id = 5 and posts_id = '1') LIMIT 1
DELETE FROM "cheers" WHERE "id" = 1
---
  def cheerdown

    @cheer = Cheer.find(:first,:conditions => ["users_id = ? and posts_id = ?",session[:user_id], params[:id]])

    @cheer.destroy