Backchannel_Application/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "grade", "created_at", "updated_at", "username", "admin", "password") VALUES('admin3', NULL, '2010-09-22 01:02:06', '2010-09-22 01:02:06', 'admin3', NULL, 'abc123')
---
  def create
     @user = User.new(params[:user])
     @user.grade = 0
     if session[:admin] == true
        @user.admin = true
     else
        @user.admin = false
     end
     if @user.save

SELECT * FROM "users" WHERE (username = NULL) LIMIT 1
---
   def search
     puts params[:username]
     if params[:username] != nil and params[:username] != ''
      @user = User.find(:first, :conditions => ['username = ?', params[:username]])

SELECT * FROM "posts" WHERE ("posts"."id" = 79)
SELECT * FROM "comments" WHERE (original_post = 71)
DELETE FROM "comments" WHERE "id" = 35
SELECT * FROM "cheers" WHERE (users_id = '5')
DELETE FROM "cheers" WHERE "id" = 8
DELETE FROM "posts" WHERE "id" = 17
DELETE FROM "users" WHERE "id" = 5
SELECT * FROM "users" WHERE ("users"."id" = 5)
---
  def destroy
    @userposts = Post.find(:all,:conditions => ["users_id = ?", params[:id]])
        for userpost in @userposts
            @allcomments = Comment.find(:all,:conditions => ["reply = ?", userpost.id])
            for comment in @allcomments
              comment.destroy
            end
            @allcomments = Comment.find(:all,:conditions => ["original_post = ?",userpost.id])
            for comment in @allcomments
              @post = Post.find(comment.reply)
              @cheers = Cheer.find(:all,:conditions => ["posts_id = ?", @post.id])
              for cheer in @cheers
                  cheer.destroy
              end
              @post.destroy
              comment.destroy
            end
            @cheers = Cheer.find(:all,:conditions => ["posts_id = ?", userpost.id])
            for cheer in @cheers
               cheer.destroy
            end
            @post = Post.find(userpost.id)
            if @post
                @post.destroy
            end
        end
        @cheers = Cheer.find(:all,:conditions => ["users_id = ?", params[:id]])
        for cheer in @cheers
             cheer.destroy
        end
        @user = User.find(params[:id])